xmrrabbitx/tlsrepair/src/tlsrepair.c
#include <stdio.h>
#include <stdlib.h>
#include <string.h>
#include <strings.h>
#include <openssl/ssl.h>
#include <openssl/x509.h>
#include <openssl/x509_vfy.h>
#include <openssl/x509v3.h>
#include <openssl/pem.h>
#include "tlsrepair.h"
#include <curl/curl.h>
#include <limits.h>
#include <stdint.h>

#define TLSREPAIR_MAX_AIA_DEPTH 8

struct Memory {
    unsigned char *data;
    size_t size;
};

struct TLSRepair {
    CURL *curl;
    char *url;
    char *proxy;
    STACK_OF(X509) *aia_certificates;
    int repaired;
    char *error;
};

static void set_error(
    TLSRepair *repair,
    const char *message
);

static void set_curl_error(
    TLSRepair *repair,
    const char *operation,
    CURLcode result
)
{
    char error_message[256];

    snprintf(
        error_message,
        sizeof(error_message),
        "%s: %d (%s)",
        operation,
        result,
        curl_easy_strerror(result)
    );

    set_error(
        repair,
        error_message
    );
}

static void set_error(
    TLSRepair *repair,
    const char *message
)
{
    if(!repair){
        return;
    }

    free(repair->error);

    repair->error = NULL;

    if(!message){
        return;
    }

    repair->error =
        malloc(
            strlen(message) + 1
        );

    if(!repair->error){
        return;
    }

    strcpy(
        repair->error,
        message
    );
}

const char *tlsrepair_error(
    TLSRepair *repair
)
{
    if(!repair){
        return NULL;
    }

    return repair->error;
}

static size_t write_callback(
    void *contents,
    size_t size,
    size_t nmemb,
    void *userp
)
{
    struct Memory *memory = userp;

    if(nmemb != 0 &&
       size > SIZE_MAX / nmemb){

        return 0;
    }

    size_t total = size * nmemb;

    if(memory->size > SIZE_MAX - total - 1){

        return 0;
    }

    unsigned char *new_data =
        realloc(
            memory->data,
            memory->size + total + 1
        );

    if(!new_data){
        return 0;
    }

    memory->data = new_data;

    memcpy(
        memory->data + memory->size,
        contents,
        total
    );

    memory->size += total;

    memory->data[memory->size] = '\0';

    return total;
}

static size_t discard_callback(
    void *contents,
    size_t size,
    size_t nmemb,
    void *userp
)
{
    (void)contents;
    (void)userp;

    if(nmemb != 0 &&
        size > SIZE_MAX / nmemb){

        return 0;
    }

    return size * nmemb;
}

static X509 *parse_certificate(
    TLSRepair *repair,
    const char *data
)
{
    if(!data){
        set_error(
            repair,
            "invalid certificate data"
        );

        return NULL;
    }

    const char *pem =
        strstr(
            data,
            "-----BEGIN CERTIFICATE-----"
        );

    if(!pem){
        set_error(
            repair,
            "certificate PEM data not found"
        );

        return NULL;
    }

    BIO *bio =
        BIO_new_mem_buf(
            pem,
            -1
        );

    if(!bio){
        set_error(
            repair,
            "failed to create certificate memory BIO"
        );

        return NULL;
    }

    X509 *cert =
        PEM_read_bio_X509(
            bio,
            NULL,
            NULL,
            NULL
        );

    BIO_free(bio);

    if(!cert){
        set_error(
            repair,
            "failed to parse PEM certificate"
        );

        return NULL;
    }

    return cert;
}

static X509 *parse_certificate_memory(
    TLSRepair *repair,
    const unsigned char *data,
    size_t size
)
{
    if(!data || size == 0){
        set_error(
            repair,
            "invalid certificate data"
        );

        return NULL;
    }

    if(size > LONG_MAX ||
       size > INT_MAX){

        set_error(
            repair,
            "certificate data is too large"
        );

        return NULL;
    }

    const unsigned char *ptr = data;

    X509 *cert =
        d2i_X509(
            NULL,
            &ptr,
            (long)size
        );

    if(cert){
        return cert;
    }

    BIO *bio =
        BIO_new_mem_buf(
            data,
            (int)size
        );

    if(!bio){
        set_error(
            repair,
            "failed to create certificate memory BIO"
        );

        return NULL;
    }

    cert =
        PEM_read_bio_X509(
            bio,
            NULL,
            NULL,
            NULL
        );

    BIO_free(bio);

    if(!cert){
        set_error(
            repair,
            "failed to parse certificate"
        );

        return NULL;
    }

    return cert;
}

static STACK_OF(X509) *parse_certificates(
    TLSRepair *repair,
    struct curl_certinfo *certInfo
)
{
    if(!certInfo){
        set_error(
            repair,
            "certificate information is unavailable"
        );

        return NULL;
    }

    STACK_OF(X509) *certificates =
        sk_X509_new_null();

    if(!certificates){
        set_error(
            repair,
            "failed to create certificate stack"
        );

        return NULL;
    }

    for(int i = 0;
        i < certInfo->num_of_certs;
        i++){

        struct curl_slist *item =
            certInfo->certinfo[i];

        while(item){

            if(item->data &&
               strstr(
                   item->data,
                   "-----BEGIN CERTIFICATE-----"
               )){

                X509 *cert =
                    parse_certificate(
                        repair,
                        item->data
                    );

                if(!cert){
                    item = item->next;
                    continue;
                }

                if(!sk_X509_push(
                    certificates,
                    cert
                )){

                    set_error(
                        repair,
                        "failed to add certificate to certificate stack"
                    );

                    X509_free(cert);

                    sk_X509_pop_free(
                        certificates,
                        X509_free
                    );

