xmrrabbitx/tlsrepair/src/tlsrepair.c
                    return NULL;
                }
            }

            item = item->next;
        }
    }

    return certificates;
}

static X509_STORE *create_trust_store(
    TLSRepair *repair
)
{
    X509_STORE *store =
        X509_STORE_new();

    if(!store){
        set_error(
            repair,
            "failed to create certificate trust store"
        );

        return NULL;
    }

    if(X509_STORE_set_default_paths(
        store
    ) != 1){

        set_error(
            repair,
            "failed to load default certificate trust store paths"
        );

        X509_STORE_free(store);

        return NULL;
    }

    return store;
}

static STACK_OF(X509) *create_untrusted_stack(
    TLSRepair *repair,
    STACK_OF(X509) *certificates
)
{
    if(!certificates){
        set_error(
            repair,
            "certificate stack is unavailable"
        );

        return NULL;
    }

    STACK_OF(X509) *untrusted =
        sk_X509_new_null();

    if(!untrusted){
        set_error(
            repair,
            "failed to create untrusted certificate stack"
        );

        return NULL;
    }

    for(int i = 1;
        i < sk_X509_num(certificates);
        i++){

        X509 *cert =
            sk_X509_value(
                certificates,
                i
            );

        if(!cert){
            continue;
        }

        if(X509_up_ref(cert) != 1){

            set_error(
                repair,
                "failed to increase certificate reference"
            );

            sk_X509_pop_free(
                untrusted,
                X509_free
            );

            return NULL;
        }

        if(!sk_X509_push(
            untrusted,
            cert
        )){

            set_error(
                repair,
                "failed to add certificate to untrusted certificate stack"
            );

            sk_X509_pop_free(
                untrusted,
                X509_free
            );

            return NULL;
        }
    }

    return untrusted;
}

static int verify_certificate_chain(
    TLSRepair *repair,
    X509 *leaf,
    X509_STORE *store,
    STACK_OF(X509) *untrusted
)
{
    if(!leaf || !store){
        set_error(
            repair,
            "invalid certificate verification parameters"
        );

        return -1;
    }

    X509_STORE_CTX *ctx =
        X509_STORE_CTX_new();

    if(!ctx){
        set_error(
            repair,
            "failed to create certificate verification context"
        );

        return -1;
    }

    if(X509_STORE_CTX_init(
        ctx,
        store,
        leaf,
        untrusted
    ) != 1){

        set_error(
            repair,
            "failed to initialize certificate verification context"
        );

        X509_STORE_CTX_free(ctx);

        return -1;
    }

    int result =
        X509_verify_cert(ctx);

    if(result != 1){

        int error =
            X509_STORE_CTX_get_error(ctx);

        char error_message[256];

        snprintf(
            error_message,
            sizeof(error_message),
            "certificate verification failed: %d (%s)",
            error,
            X509_verify_cert_error_string(error)
        );

        set_error(
            repair,
            error_message
        );
    }

    X509_STORE_CTX_free(ctx);

    return result;
}

static char *get_aia_url(
    TLSRepair *repair,
    X509 *cert
)
{
    if(!cert){
        set_error(
            repair,
            "invalid certificate for AIA lookup"
        );

        return NULL;
    }

    AUTHORITY_INFO_ACCESS *aia =
        X509_get_ext_d2i(
            cert,
            NID_info_access,
            NULL,
            NULL
        );

    if(!aia){
        return NULL;
    }

    for(int i = 0;
        i < sk_ACCESS_DESCRIPTION_num(aia);
        i++){

        ACCESS_DESCRIPTION *ad =
            sk_ACCESS_DESCRIPTION_value(
                aia,
                i
            );

        if(!ad){
            continue;
        }

        if(OBJ_obj2nid(
            ad->method
        ) != NID_ad_ca_issuers){

            continue;
        }

        if(!ad->location){
            continue;
        }

        if(ad->location->type != GEN_URI){
            continue;
        }

        ASN1_IA5STRING *uri =
            ad->location->
                d.uniformResourceIdentifier;

        if(!uri){
            continue;
        }

        const unsigned char *data =
            ASN1_STRING_get0_data(uri);

        int length =
            ASN1_STRING_length(uri);

        if(!data || length <= 0){
            continue;
        }

        char *url =
            malloc(
                (size_t)length + 1
            );

        if(!url){

            set_error(
                repair,
                "failed to allocate AIA URL"
            );

            AUTHORITY_INFO_ACCESS_free(aia);

            return NULL;
        }

        memcpy(
            url,
            data,
            (size_t)length
        );

        url[length] = '\0';

        if(strncasecmp(url, "http://", 7) != 0 &&
           strncasecmp(url, "https://", 8) != 0){

                set_error(
                    repair,
                    "unsupported AIA URL scheme"
                );

                free(url);

                AUTHORITY_INFO_ACCESS_free(aia);

                return NULL;
            }

        AUTHORITY_INFO_ACCESS_free(aia);

        return url;
    }

    AUTHORITY_INFO_ACCESS_free(aia);

    return NULL;
}

static int certificate_matches_issuer(
    X509 *leaf,
    X509 *issuer
)
{
    if(!leaf || !issuer){
        return 0;
    }

    X509_NAME *leaf_issuer =
        X509_get_issuer_name(leaf);

    X509_NAME *issuer_subject =
        X509_get_subject_name(issuer);

    if(!leaf_issuer ||
       !issuer_subject){

        return 0;
    }

    if(X509_NAME_cmp(
        leaf_issuer,
        issuer_subject
    ) != 0){

        return 0;
    }

    EVP_PKEY *key =
        X509_get_pubkey(issuer);

