xmrrabbitx/tlsrepair/src/tlsrepair.c
    if(!key){
        return 0;
    }

    int result =
        X509_verify(
            leaf,
            key
        );

    EVP_PKEY_free(key);

    return result == 1;
}

static int stack_contains_certificate(
    STACK_OF(X509) *stack,
    X509 *cert
)
{
    if(!stack || !cert){
        return 0;
    }

    for(int i = 0;
        i < sk_X509_num(stack);
        i++){

        X509 *existing =
            sk_X509_value(
                stack,
                i
            );

        if(existing &&
           X509_cmp(
               existing,
               cert
           ) == 0){

            return 1;
        }
    }

    return 0;
}

static int add_certificate_to_untrusted(
    STACK_OF(X509) *untrusted,
    X509 *cert
)
{
    if(!untrusted || !cert){
        return 0;
    }

    if(stack_contains_certificate(
        untrusted,
        cert
    )){
        return 1;
    }

    if(X509_up_ref(cert) != 1){
        return 0;
    }

    if(!sk_X509_push(
        untrusted,
        cert
    )){

        X509_free(cert);

        return 0;
    }

    return 1;
}

static int add_certificate_to_repair(
    TLSRepair *repair,
    X509 *cert
)
{
    if(!repair || !cert){
        return 0;
    }

    if(!repair->aia_certificates){

        repair->aia_certificates =
            sk_X509_new_null();

        if(!repair->aia_certificates){
            set_error(
                repair,
                "failed to create AIA certificate stack"
            );

            return 0;
        }
    }

    if(stack_contains_certificate(
        repair->aia_certificates,
        cert
    )){
        return 1;
    }

    if(X509_up_ref(cert) != 1){
        set_error(
            repair,
            "failed to increase AIA certificate reference count"
        );

        if(sk_X509_num(
            repair->aia_certificates
        ) == 0){

            sk_X509_free(
                repair->aia_certificates
            );

            repair->aia_certificates = NULL;
        }

        return 0;
    }

    if(!sk_X509_push(
        repair->aia_certificates,
        cert
    )){

        set_error(
            repair,
            "failed to add certificate to AIA repair chain"
        );

        X509_free(cert);

        if(sk_X509_num(
            repair->aia_certificates
        ) == 0){

            sk_X509_free(
                repair->aia_certificates
            );

            repair->aia_certificates = NULL;
        }

        return 0;
    }

    return 1;
}

static int add_intermediates_to_verify_context(
    X509_STORE_CTX *ctx,
    STACK_OF(X509) *certificates
)
{
    if(!ctx || !certificates){
        return 0;
    }

    STACK_OF(X509) *untrusted =
        X509_STORE_CTX_get0_untrusted(ctx);

    if(!untrusted){
        return 0;
    }

    for(int i = 0;
        i < sk_X509_num(certificates);
        i++){

        X509 *cert =
            sk_X509_value(
                certificates,
                i
            );

        if(!cert){
            continue;
        }

        if(!add_certificate_to_untrusted(
            untrusted,
            cert
        )){
            return 0;
        }
    }

    return 1;
}

static int cert_verify_callback(
    X509_STORE_CTX *ctx,
    void *arg
)
{
    TLSRepair *repair = arg;

    if(!ctx){
        return 0;
    }

    if(repair &&
       repair->aia_certificates){

        if(!add_intermediates_to_verify_context(
            ctx,
            repair->aia_certificates
        )){

            set_error(
                repair,
                "failed to add AIA certificates to verification context"
            );

            return 0;
        }
    }

    int result =
        X509_verify_cert(ctx);

    if(result != 1){

        int error =
            X509_STORE_CTX_get_error(ctx);

        int depth =
            X509_STORE_CTX_get_error_depth(ctx);

        char msg[256];

        snprintf(
            msg,
            sizeof(msg),
            "certificate verification failed depth=%d error=%d (%s)",
            depth,
            error,
            X509_verify_cert_error_string(error)
        );

        if(repair){
            set_error(
                repair,
                msg
            );
        }

        return 0;
    }

    return 1;
}

static CURLcode ssl_ctx_callback(
    CURL *curl,
    void *sslctx,
    void *clientp
)
{
    (void)curl;

    SSL_CTX *ctx = sslctx;
    TLSRepair *repair = clientp;

    if(!ctx || !repair){
        return CURLE_OK;
    }

    if(!repair->aia_certificates ||
       sk_X509_num(
           repair->aia_certificates
       ) == 0){

        return CURLE_OK;
    }

    SSL_CTX_set_cert_verify_callback(
        ctx,
        cert_verify_callback,
        repair
    );

    return CURLE_OK;
}

static int configure_curl_with_intermediates(
    TLSRepair *repair
)
{
    if(!repair){
        return 0;
    }

    if(!repair->curl){
        set_error(
            repair,
            "CURL handle is unavailable"
        );

        return 0;
    }

    if(!repair->aia_certificates ||
       sk_X509_num(
           repair->aia_certificates
       ) == 0){

        set_error(
            repair,
            "AIA repair certificates are unavailable"
        );

        return 0;
    }

    CURLcode result;

    result =
        curl_easy_setopt(
            repair->curl,
            CURLOPT_SSL_CTX_FUNCTION,
            ssl_ctx_callback
        );

    if(result != CURLE_OK){
        set_curl_error(
            repair,
            "failed to configure SSL context",
            result
        );

        return 0;
    }

    result =
        curl_easy_setopt(
            repair->curl,
            CURLOPT_SSL_CTX_DATA,
            repair
        );

    if(result != CURLE_OK){
        set_curl_error(
            repair,
            "failed to configure SSL context data",
            result
        );

        return 0;
    }

    result =
        curl_easy_setopt(
            repair->curl,
            CURLOPT_SSL_VERIFYPEER,
            1L
        );

    if(result != CURLE_OK){
        set_curl_error(
            repair,
            "failed to enable SSL certificate verification",
            result
        );

