xmrrabbitx/tlsrepair/src/tlsrepair.c
        return 0;
    }

    result =
        curl_easy_setopt(
            repair->curl,
            CURLOPT_SSL_VERIFYHOST,
            2L
        );

    if(result != CURLE_OK){
        set_curl_error(
            repair,
            "failed to set CURLOPT_SSL_VERIFYHOST",
            result
        );

        return 0;
    }

    result =
        curl_easy_setopt(
            repair->curl,
            CURLOPT_FRESH_CONNECT,
            1L
        );

    if(result != CURLE_OK){
        set_curl_error(
            repair,
            "failed to set CURLOPT_FRESH_CONNECT",
            result
        );

        return 0;
    }

    return 1;
}

static int reset_curl_for_final_request(
    TLSRepair *repair,
    CURL *curl,
    const char *url
)
{
    if(!repair){
        return 0;
    }

    if(!curl || !url){
        set_error(
            repair,
            "invalid CURL handle or URL"
        );

        return 0;
    }

    CURLcode result;

    result =
        curl_easy_setopt(
            curl,
            CURLOPT_URL,
            url
        );

    if(result != CURLE_OK){
        set_curl_error(
            repair,
            "failed to set CURLOPT_URL",
            result
        );

        return 0;
    }

    result =
        curl_easy_setopt(
            curl,
            CURLOPT_NOBODY,
            0L
        );

    if(result != CURLE_OK){
        set_curl_error(
            repair,
            "failed to set CURLOPT_NOBODY",
            result
        );

        return 0;
    }

    result =
        curl_easy_setopt(
            curl,
            CURLOPT_HTTPGET,
            1L
        );

    if(result != CURLE_OK){
        set_curl_error(
            repair,
            "failed to set CURLOPT_HTTPGET",
            result
        );

        return 0;
    }

    result =
        curl_easy_setopt(
            curl,
            CURLOPT_CUSTOMREQUEST,
            NULL
        );

    if(result != CURLE_OK){
        set_curl_error(
            repair,
            "failed to set CURLOPT_CUSTOMREQUEST",
            result
        );

        return 0;
    }

    result =
        curl_easy_setopt(
            curl,
            CURLOPT_POST,
            0L
        );

    if(result != CURLE_OK){
        set_curl_error(
            repair,
            "failed to set CURLOPT_POST",
            result
        );

        return 0;
    }

    result =
        curl_easy_setopt(
            curl,
            CURLOPT_UPLOAD,
            0L
        );

    if(result != CURLE_OK){
        set_curl_error(
            repair,
            "failed to set CURLOPT_UPLOAD",
            result
        );

        return 0;
    }

    result =
        curl_easy_setopt(
            curl,
            CURLOPT_SSL_VERIFYPEER,
            1L
        );

    if(result != CURLE_OK){
        set_curl_error(
            repair,
            "failed to set CURLOPT_SSL_VERIFYPEER",
            result
        );

        return 0;
    }

    result =
        curl_easy_setopt(
            curl,
            CURLOPT_SSL_VERIFYHOST,
            2L
        );

    if(result != CURLE_OK){
        set_curl_error(
            repair,
            "failed to set CURLOPT_SSL_VERIFYHOST",
            result
        );

        return 0;
    }

    result =
        curl_easy_setopt(
            curl,
            CURLOPT_FRESH_CONNECT,
            1L
        );

    if(result != CURLE_OK){
        set_curl_error(
            repair,
            "failed to set CURLOPT_FRESH_CONNECT",
            result
        );

        return 0;
    }

    return 1;
}

static int get_server_certificates(
    TLSRepair *repair,
    CURL *curl,
    const char *url,
    STACK_OF(X509) **certificates
)
{
    if(!repair){
        return 0;
    }

    if(!curl || !url || !certificates){
        set_error(
            repair,
            "invalid server certificate discovery parameters"
        );

        return 0;
    }

    *certificates = NULL;

    CURLcode result;

    result =
        curl_easy_setopt(
            curl,
            CURLOPT_URL,
            url
        );

    if(result != CURLE_OK){
        set_curl_error(
            repair,
            "failed to set CURLOPT_URL",
            result
        );

        return 0;
    }

    result =
        curl_easy_setopt(
            curl,
            CURLOPT_NOBODY,
            0L
        );

    if(result != CURLE_OK){
        set_curl_error(
            repair,
            "failed to set CURLOPT_NOBODY",
            result
        );

        return 0;
    }

    result =
        curl_easy_setopt(
            curl,
            CURLOPT_HTTPGET,
            1L
        );

    if(result != CURLE_OK){
        set_curl_error(
            repair,
            "failed to set CURLOPT_HTTPGET",
            result
        );

        return 0;
    }

    result =
        curl_easy_setopt(
            curl,
            CURLOPT_CERTINFO,
            1L
        );

    if(result != CURLE_OK){
        set_curl_error(
            repair,
            "failed to set CURLOPT_CERTINFO",
            result
        );

        return 0;
    }

    result =
        curl_easy_setopt(
            curl,
            CURLOPT_SSL_VERIFYPEER,
            0L
        );

    if(result != CURLE_OK){
        set_curl_error(
            repair,
            "failed to disable SSL certificate verification",
            result
        );

        return 0;
    }

    result =
        curl_easy_setopt(
            curl,
            CURLOPT_SSL_VERIFYHOST,
            0L
        );

    if(result != CURLE_OK){
        set_curl_error(
            repair,
            "failed to disable SSL hostname verification",
            result
        );

        return 0;
    }

    result =
        curl_easy_setopt(
            curl,
            CURLOPT_FRESH_CONNECT,
            1L
        );

    if(result != CURLE_OK){
        set_curl_error(
            repair,
            "failed to set CURLOPT_FRESH_CONNECT",
            result
        );

