xmrrabbitx/tlsrepair/src/tlsrepair.c
        return 0;
    }

    result =
        curl_easy_setopt(
            curl,
            CURLOPT_WRITEFUNCTION,
            discard_callback
        );

    if(result != CURLE_OK){
        set_curl_error(
            repair,
            "failed to set CURLOPT_WRITEFUNCTION",
            result
        );

        return 0;
    }

    result =
        curl_easy_setopt(
            curl,
            CURLOPT_WRITEDATA,
            NULL
        );

    if(result != CURLE_OK){
        set_curl_error(
            repair,
            "failed to set CURLOPT_WRITEDATA",
            result
        );

        return 0;
    }

    result =
        curl_easy_perform(curl);

    if(result != CURLE_OK){
        set_curl_error(
            repair,
            "server certificate discovery request failed",
            result
        );

        return 0;
    }

    struct curl_certinfo *certInfo = NULL;

    result =
        curl_easy_getinfo(
            curl,
            CURLINFO_CERTINFO,
            &certInfo
        );

    if(result != CURLE_OK){
        set_curl_error(
            repair,
            "failed to get CURLINFO_CERTINFO",
            result
        );

        return 0;
    }

    if(!certInfo){
        set_error(
            repair,
            "server certificate information is unavailable"
        );

        return 0;
    }

    *certificates =
        parse_certificates(
            repair,
            certInfo
        );

    if(!*certificates){
        return 0;
    }

    if(sk_X509_num(*certificates) == 0){

        set_error(
            repair,
            "server certificate chain is empty"
        );

        sk_X509_pop_free(
            *certificates,
            X509_free
        );

        *certificates = NULL;

        return 0;
    }

    return 1;
}

static int download_aia_certificate(
    TLSRepair *repair,
    CURL *curl,
    const char *url,
    struct Memory *memory
)
{
    if(!repair){
        return 0;
    }

    if(!curl || !url || !memory){
        set_error(
            repair,
            "invalid AIA download parameters"
        );

        return 0;
    }

    memset(
        memory,
        0,
        sizeof(*memory)
    );

    CURLcode result;

    result =
        curl_easy_setopt(
            curl,
            CURLOPT_URL,
            url
        );

    if(result != CURLE_OK){
        set_curl_error(
            repair,
            "failed to set CURLOPT_URL",
            result
        );

        return 0;
    }

    result =
        curl_easy_setopt(
            curl,
            CURLOPT_NOBODY,
            0L
        );

    if(result != CURLE_OK){
        set_curl_error(
            repair,
            "failed to set CURLOPT_NOBODY",
            result
        );

        return 0;
    }

    result =
        curl_easy_setopt(
            curl,
            CURLOPT_HTTPGET,
            1L
        );

    if(result != CURLE_OK){
        set_curl_error(
            repair,
            "failed to set CURLOPT_HTTPGET",
            result
        );

        return 0;
    }

    result =
        curl_easy_setopt(
            curl,
            CURLOPT_CUSTOMREQUEST,
            NULL
        );

    if(result != CURLE_OK){
        set_curl_error(
            repair,
            "failed to set CURLOPT_CUSTOMREQUEST",
            result
        );

        return 0;
    }

    result =
        curl_easy_setopt(
            curl,
            CURLOPT_POST,
            0L
        );

    if(result != CURLE_OK){
        set_curl_error(
            repair,
            "failed to set CURLOPT_POST",
            result
        );

        return 0;
    }

    result =
        curl_easy_setopt(
            curl,
            CURLOPT_UPLOAD,
            0L
        );

    if(result != CURLE_OK){
        set_curl_error(
            repair,
            "failed to set CURLOPT_UPLOAD",
            result
        );

        return 0;
    }

    result =
        curl_easy_setopt(
            curl,
            CURLOPT_WRITEFUNCTION,
            write_callback
        );

    if(result != CURLE_OK){
        set_curl_error(
            repair,
            "failed to set CURLOPT_WRITEFUNCTION",
            result
        );

        return 0;
    }

    result =
        curl_easy_setopt(
            curl,
            CURLOPT_WRITEDATA,
            memory
        );

    if(result != CURLE_OK){
        set_curl_error(
            repair,
            "failed to set CURLOPT_WRITEDATA",
            result
        );

        return 0;
    }

    result =
        curl_easy_setopt(
            curl,
            CURLOPT_SSL_VERIFYPEER,
            0L
        );

    if(result != CURLE_OK){
        set_curl_error(
            repair,
            "failed to disable SSL certificate verification",
            result
        );

        return 0;
    }

    result =
        curl_easy_setopt(
            curl,
            CURLOPT_SSL_VERIFYHOST,
            0L
        );

    if(result != CURLE_OK){
        set_curl_error(
            repair,
            "failed to disable SSL hostname verification",
            result
        );

        return 0;
    }

    result =
        curl_easy_setopt(
            curl,
            CURLOPT_FRESH_CONNECT,
            1L
        );

    if(result != CURLE_OK){
        set_curl_error(
            repair,
            "failed to set CURLOPT_FRESH_CONNECT",
            result
        );

        return 0;
    }

    result =
        curl_easy_setopt(
            curl,
            CURLOPT_FOLLOWLOCATION,
            0L
        );

    if(result != CURLE_OK){
        set_curl_error(
            repair,
            "failed to set CURLOPT_FOLLOWLOCATION",
            result
        );

        return 0;
    }

    result =
        curl_easy_setopt(
            curl,
            CURLOPT_CONNECTTIMEOUT,
            10L
        );

    if(result != CURLE_OK){
        set_curl_error(
            repair,
            "failed to set CURLOPT_CONNECTTIMEOUT",
            result
        );

