xmrrabbitx/tlsrepair/src/tlsrepair.c
        return 0;
    }

    result =
        curl_easy_setopt(
            curl,
            CURLOPT_TIMEOUT,
            30L
        );

    if(result != CURLE_OK){
        set_curl_error(
            repair,
            "failed to set CURLOPT_TIMEOUT",
            result
        );

        return 0;
    }

    result =
        curl_easy_perform(curl);

    if(result != CURLE_OK){

        set_curl_error(
            repair,
            "AIA certificate download failed",
            result
        );

        free(memory->data);

        memory->data = NULL;
        memory->size = 0;

        return 0;
    }

    if(!memory->data ||
       memory->size == 0){

        set_error(
            repair,
            "AIA certificate download returned empty data"
        );

        free(memory->data);

        memory->data = NULL;
        memory->size = 0;

        return 0;
    }

    return 1;
}

static X509 *download_and_parse_aia_certificate(
    TLSRepair *repair,
    CURL *curl,
    const char *url
)
{
    struct Memory memory = {0};

    if(!download_aia_certificate(
        repair,
        curl,
        url,
        &memory
    )){
        return NULL;
    }

    X509 *cert =
        parse_certificate_memory(
            repair,
            memory.data,
            memory.size
        );

    free(memory.data);

    if(!cert){
        return NULL;
    }

    return cert;
}

int tlsrepair_global_init(void)
{
    return curl_global_init(
        CURL_GLOBAL_DEFAULT
    ) == CURLE_OK;
}

void tlsrepair_global_cleanup(void)
{
    curl_global_cleanup();
}

TLSRepair *tlsrepair_create(
    const char *url
)
{
    if(!url){
        return NULL;
    }

    TLSRepair *repair =
        calloc(
            1,
            sizeof(*repair)
        );

    if(!repair){
        return NULL;
    }

    repair->curl =
        curl_easy_init();

    if(!repair->curl){
        free(repair);
        return NULL;
    }

    repair->url =
        malloc(
            strlen(url) + 1
        );

    if(!repair->url){

        curl_easy_cleanup(
            repair->curl
        );

        free(repair);

        return NULL;
    }

    strcpy(
        repair->url,
        url
    );

    CURLcode result =
        curl_easy_setopt(
            repair->curl,
            CURLOPT_URL,
            repair->url
        );

    if(result != CURLE_OK){

        curl_easy_cleanup(
            repair->curl
        );

        free(repair->url);
        free(repair);

        return NULL;
    }

    result =
        curl_easy_setopt(
            repair->curl,
            CURLOPT_CONNECTTIMEOUT,
            10L
        );

    if(result != CURLE_OK){

        curl_easy_cleanup(
            repair->curl
        );

        free(repair->url);
        free(repair);

        return NULL;
    }

    result =
        curl_easy_setopt(
            repair->curl,
            CURLOPT_TIMEOUT,
            60L
        );

    if(result != CURLE_OK){

        curl_easy_cleanup(
            repair->curl
        );

        free(repair->url);
        free(repair);

        return NULL;
    }

    return repair;
}

int tlsrepair_set_proxy(
    TLSRepair *repair,
    const char *proxy
)
{
    if(!repair){
        return 0;
    }

    if(!repair->curl){
        set_error(
            repair,
            "CURL handle is unavailable"
        );

        return 0;
    }

    free(repair->proxy);

    repair->proxy = NULL;

    if(!proxy){

        CURLcode result =
            curl_easy_setopt(
                repair->curl,
                CURLOPT_PROXY,
                NULL
            );

        if(result != CURLE_OK){
            set_curl_error(
                repair,
                "failed to clear CURLOPT_PROXY",
                result
            );

            return 0;
        }

        return 1;
    }

    repair->proxy =
        malloc(
            strlen(proxy) + 1
        );

    if(!repair->proxy){
        set_error(
            repair,
            "failed to allocate proxy string"
        );

        return 0;
    }

    strcpy(
        repair->proxy,
        proxy
    );

    CURLcode result =
        curl_easy_setopt(
            repair->curl,
            CURLOPT_PROXY,
            repair->proxy
        );

    if(result != CURLE_OK){

        set_curl_error(
            repair,
            "failed to set CURLOPT_PROXY",
            result
        );

        free(repair->proxy);

        repair->proxy = NULL;

        return 0;
    }

    return 1;
}

int tlsrepair_prepare(
    TLSRepair *repair
)
{
    if(!repair){
        return 0;
    }

    set_error(
        repair,
        NULL
    );

    if(!repair->curl ||
       !repair->url){

        set_error(
            repair,
            "invalid TLSRepair handle or URL"
        );

        return 0;
    }

    repair->repaired = 0;

    if(repair->aia_certificates){

        sk_X509_pop_free(
            repair->aia_certificates,
            X509_free
        );

        repair->aia_certificates = NULL;
    }

    CURLcode result;

    result =
        curl_easy_setopt(
            repair->curl,
            CURLOPT_SSL_CTX_FUNCTION,
            NULL
        );

    if(result != CURLE_OK){
        set_curl_error(
            repair,
            "failed to clear SSL context callback",
            result
        );

        return 0;
    }

    result =
        curl_easy_setopt(
            repair->curl,
            CURLOPT_SSL_CTX_DATA,
            NULL
        );

    if(result != CURLE_OK){
        set_curl_error(
            repair,
            "failed to clear SSL context callback data",
            result
        );

        return 0;
    }

    STACK_OF(X509) *certificates = NULL;

    if(!get_server_certificates(
        repair,
        repair->curl,
        repair->url,
        &certificates
    )){
        return 0;
    }

    X509 *leaf =
        sk_X509_value(
            certificates,
            0
        );

    if(!leaf){

        set_error(
            repair,
            "server certificate chain does not contain a leaf certificate"
        );

        sk_X509_pop_free(
            certificates,
            X509_free
        );

