xmrrabbitx/tlsrepair/src/tlsrepair.c
        return 0;
    }

    X509_STORE *store =
        create_trust_store(repair);

    if(!store){

        sk_X509_pop_free(
            certificates,
            X509_free
        );

        return 0;
    }

    STACK_OF(X509) *untrusted =
        create_untrusted_stack(
            repair,
            certificates
        );

    if(!untrusted){

        X509_STORE_free(store);

        sk_X509_pop_free(
            certificates,
            X509_free
        );

        return 0;
    }

    int verifyResult =
        verify_certificate_chain(
            repair,
            leaf,
            store,
            untrusted
        );

    if(verifyResult == 1){

        sk_X509_pop_free(
            untrusted,
            X509_free
        );

        X509_STORE_free(store);

        sk_X509_pop_free(
            certificates,
            X509_free
        );

        return reset_curl_for_final_request(
            repair,
            repair->curl,
            repair->url
        );
    }


    if(verifyResult < 0){

        sk_X509_pop_free(
            untrusted,
            X509_free
        );

        X509_STORE_free(store);

        sk_X509_pop_free(
            certificates,
            X509_free
        );

        return 0;
    }

    X509 *current = X509_dup(leaf);

    if(!current){

        set_error(
            repair,
            "failed to duplicate leaf certificate"
        );

        X509_free(current);
        current = NULL;

        sk_X509_pop_free(
            untrusted,
            X509_free
        );

        X509_STORE_free(store);

        sk_X509_pop_free(
            certificates,
            X509_free
        );

        return 0;
    }
    

    int repaired = 0;

    for(int depth = 0;
        depth < TLSREPAIR_MAX_AIA_DEPTH;
        depth++){

        char *aiaUrl =
            get_aia_url(
                repair,
                current
            );

        if(!aiaUrl){

            if(!repair->error){

                char error_message[256];

                snprintf(
                    error_message,
                    sizeof(error_message),
                    "no AIA issuer URL available at certificate depth %d",
                    depth
                );

                set_error(
                    repair,
                    error_message
                );
            }

            break;
        }

        X509 *aiaCert =
            download_and_parse_aia_certificate(
                repair,
                repair->curl,
                aiaUrl
            );

        free(aiaUrl);

        if(!aiaCert){
            break;
        }

        if(!certificate_matches_issuer(
            current,
            aiaCert
        )){

            set_error(
                repair,
                "AIA certificate is not the issuer of the current certificate"
            );

            X509_free(aiaCert);

            break;
        }

        if(stack_contains_certificate(
            untrusted,
            aiaCert
        )){

            X509_free(aiaCert);

            break;
        }

        if(!sk_X509_push(
            untrusted,
            aiaCert
        )){

            set_error(
                repair,
                "failed to add AIA certificate to verification chain"
            );

            X509_free(aiaCert);

            break;
        }

        if(!add_certificate_to_repair(
            repair,
            aiaCert
        )){

            sk_X509_pop(untrusted);
            X509_free(aiaCert);

            break;
        }

        int result =
            verify_certificate_chain(
                repair,
                leaf,
                store,
                untrusted
            );

        if(result == 1){

            repaired = 1;

            set_error(
                repair,
                NULL
            );

            sk_X509_pop(
                untrusted
            );

            X509_free(aiaCert);

            break;
        }

        if(result < 0){
            sk_X509_pop(untrusted);
            X509_free(aiaCert);
            break;
        }

        X509 *next = X509_dup(aiaCert);

        if(!next){

            set_error(
                repair,
                "failed to duplicate AIA issuer certificate"
            );

            X509_free(aiaCert);

            break;
        }


        X509_free(current);

        current = next;
    }

    X509_free(current);
    
    sk_X509_pop_free(
        untrusted,
        X509_free
    );
    X509_STORE_free(store);
    sk_X509_pop_free(
        certificates,
        X509_free
    );

    if(!repaired){

        if(repair->aia_certificates){

            sk_X509_pop_free(
                repair->aia_certificates,
                X509_free
            );

            repair->aia_certificates = NULL;
        }

        if(!repair->error){

            set_error(
                repair,
                "failed to repair certificate chain"
            );
        }

        return 0;
    }

    if(!configure_curl_with_intermediates(
        repair
    )){

        sk_X509_pop_free(
            repair->aia_certificates,
            X509_free
        );

        repair->aia_certificates = NULL;

        return 0;
    }

    if(!reset_curl_for_final_request(
        repair,
        repair->curl,
        repair->url
    )){

        repair->repaired = 0;

        return 0;
    }

    repair->repaired = 1;

    return 1;
}

CURL *tlsrepair_curl(
    TLSRepair *repair
)
{
    if(!repair){
        return NULL;
    }

    return repair->curl;
}

void tlsrepair_destroy(
    TLSRepair *repair
)
{
    if(!repair){
        return;
    }

    if(repair->curl){
        curl_easy_cleanup(
            repair->curl
        );
    }

    if(repair->aia_certificates){

        sk_X509_pop_free(
            repair->aia_certificates,
            X509_free
        );
    }

    free(repair->error);
    free(repair->proxy);
    free(repair->url);
    free(repair);
}